mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xk/common/mb9bf56xk.h
#define bFM_GPIO_PFR0_P0                          *((volatile  uint8_t *)(0x42DE0000UL))
#define bFM4_GPIO_PFR0_P0                         *((volatile  uint8_t *)(0x42DE0000UL))
#define bFM_GPIO_PFR0_P1                          *((volatile  uint8_t *)(0x42DE0004UL))
#define bFM4_GPIO_PFR0_P1                         *((volatile  uint8_t *)(0x42DE0004UL))
#define bFM_GPIO_PFR0_P2                          *((volatile  uint8_t *)(0x42DE0008UL))
#define bFM4_GPIO_PFR0_P2                         *((volatile  uint8_t *)(0x42DE0008UL))
#define bFM_GPIO_PFR0_P3                          *((volatile  uint8_t *)(0x42DE000CUL))
#define bFM4_GPIO_PFR0_P3                         *((volatile  uint8_t *)(0x42DE000CUL))
#define bFM_GPIO_PFR0_P4                          *((volatile  uint8_t *)(0x42DE0010UL))
#define bFM4_GPIO_PFR0_P4                         *((volatile  uint8_t *)(0x42DE0010UL))

#define bFM_GPIO_PFR1_P0                          *((volatile  uint8_t *)(0x42DE0080UL))
#define bFM4_GPIO_PFR1_P0                         *((volatile  uint8_t *)(0x42DE0080UL))
#define bFM_GPIO_PFR1_P1                          *((volatile  uint8_t *)(0x42DE0084UL))
#define bFM4_GPIO_PFR1_P1                         *((volatile  uint8_t *)(0x42DE0084UL))
#define bFM_GPIO_PFR1_P2                          *((volatile  uint8_t *)(0x42DE0088UL))
#define bFM4_GPIO_PFR1_P2                         *((volatile  uint8_t *)(0x42DE0088UL))
#define bFM_GPIO_PFR1_P3                          *((volatile  uint8_t *)(0x42DE008CUL))
#define bFM4_GPIO_PFR1_P3                         *((volatile  uint8_t *)(0x42DE008CUL))

#define bFM_GPIO_PFR2_P0                          *((volatile  uint8_t *)(0x42DE0100UL))
#define bFM4_GPIO_PFR2_P0                         *((volatile  uint8_t *)(0x42DE0100UL))
#define bFM_GPIO_PFR2_P1                          *((volatile  uint8_t *)(0x42DE0104UL))
#define bFM4_GPIO_PFR2_P1                         *((volatile  uint8_t *)(0x42DE0104UL))
#define bFM_GPIO_PFR2_P2                          *((volatile  uint8_t *)(0x42DE0108UL))
#define bFM4_GPIO_PFR2_P2                         *((volatile  uint8_t *)(0x42DE0108UL))
#define bFM_GPIO_PFR2_P3                          *((volatile  uint8_t *)(0x42DE010CUL))
#define bFM4_GPIO_PFR2_P3                         *((volatile  uint8_t *)(0x42DE010CUL))

#define bFM_GPIO_PFR3_P0                          *((volatile  uint8_t *)(0x42DE0180UL))
#define bFM4_GPIO_PFR3_P0                         *((volatile  uint8_t *)(0x42DE0180UL))
#define bFM_GPIO_PFR3_P1                          *((volatile  uint8_t *)(0x42DE0184UL))
#define bFM4_GPIO_PFR3_P1                         *((volatile  uint8_t *)(0x42DE0184UL))
#define bFM_GPIO_PFR3_P2                          *((volatile  uint8_t *)(0x42DE0188UL))
#define bFM4_GPIO_PFR3_P2                         *((volatile  uint8_t *)(0x42DE0188UL))
#define bFM_GPIO_PFR3_P3                          *((volatile  uint8_t *)(0x42DE018CUL))
#define bFM4_GPIO_PFR3_P3                         *((volatile  uint8_t *)(0x42DE018CUL))
#define bFM_GPIO_PFR3_P4                          *((volatile  uint8_t *)(0x42DE0190UL))
#define bFM4_GPIO_PFR3_P4                         *((volatile  uint8_t *)(0x42DE0190UL))
#define bFM_GPIO_PFR3_P5                          *((volatile  uint8_t *)(0x42DE0194UL))
#define bFM4_GPIO_PFR3_P5                         *((volatile  uint8_t *)(0x42DE0194UL))

#define bFM_GPIO_PFR4_P6                          *((volatile  uint8_t *)(0x42DE0218UL))
#define bFM4_GPIO_PFR4_P6                         *((volatile  uint8_t *)(0x42DE0218UL))
#define bFM_GPIO_PFR4_P7                          *((volatile  uint8_t *)(0x42DE021CUL))
#define bFM4_GPIO_PFR4_P7                         *((volatile  uint8_t *)(0x42DE021CUL))

#define bFM_GPIO_PFR5_P4                          *((volatile  uint8_t *)(0x42DE0290UL))
#define bFM4_GPIO_PFR5_P4                         *((volatile  uint8_t *)(0x42DE0290UL))
#define bFM_GPIO_PFR5_P5                          *((volatile  uint8_t *)(0x42DE0294UL))
#define bFM4_GPIO_PFR5_P5                         *((volatile  uint8_t *)(0x42DE0294UL))
#define bFM_GPIO_PFR5_P6                          *((volatile  uint8_t *)(0x42DE0298UL))
#define bFM4_GPIO_PFR5_P6                         *((volatile  uint8_t *)(0x42DE0298UL))
#define bFM_GPIO_PFR5_P7                          *((volatile  uint8_t *)(0x42DE029CUL))
#define bFM4_GPIO_PFR5_P7                         *((volatile  uint8_t *)(0x42DE029CUL))

#define bFM_GPIO_PFR6_P0                          *((volatile  uint8_t *)(0x42DE0300UL))
#define bFM4_GPIO_PFR6_P0                         *((volatile  uint8_t *)(0x42DE0300UL))
#define bFM_GPIO_PFR6_P1                          *((volatile  uint8_t *)(0x42DE0304UL))
#define bFM4_GPIO_PFR6_P1                         *((volatile  uint8_t *)(0x42DE0304UL))
#define bFM_GPIO_PFR6_P6                          *((volatile  uint8_t *)(0x42DE0318UL))
#define bFM4_GPIO_PFR6_P6                         *((volatile  uint8_t *)(0x42DE0318UL))

#define bFM_GPIO_PFR8_P0                          *((volatile  uint8_t *)(0x42DE0400UL))
#define bFM4_GPIO_PFR8_P0                         *((volatile  uint8_t *)(0x42DE0400UL))
#define bFM_GPIO_PFR8_P1                          *((volatile  uint8_t *)(0x42DE0404UL))
#define bFM4_GPIO_PFR8_P1                         *((volatile  uint8_t *)(0x42DE0404UL))

#define bFM_GPIO_PFRE_P0                          *((volatile  uint8_t *)(0x42DE0700UL))
#define bFM4_GPIO_PFRE_P0                         *((volatile  uint8_t *)(0x42DE0700UL))
#define bFM_GPIO_PFRE_P2                          *((volatile  uint8_t *)(0x42DE0708UL))
#define bFM4_GPIO_PFRE_P2                         *((volatile  uint8_t *)(0x42DE0708UL))
#define bFM_GPIO_PFRE_P3                          *((volatile  uint8_t *)(0x42DE070CUL))
#define bFM4_GPIO_PFRE_P3                         *((volatile  uint8_t *)(0x42DE070CUL))

#define bFM_GPIO_PZR0_P0                          *((volatile  uint8_t *)(0x42DEE000UL))
#define bFM4_GPIO_PZR0_P0                         *((volatile  uint8_t *)(0x42DEE000UL))
#define bFM_GPIO_PZR0_P1                          *((volatile  uint8_t *)(0x42DEE004UL))
#define bFM4_GPIO_PZR0_P1                         *((volatile  uint8_t *)(0x42DEE004UL))
#define bFM_GPIO_PZR0_P2                          *((volatile  uint8_t *)(0x42DEE008UL))
#define bFM4_GPIO_PZR0_P2                         *((volatile  uint8_t *)(0x42DEE008UL))
#define bFM_GPIO_PZR0_P3                          *((volatile  uint8_t *)(0x42DEE00CUL))
#define bFM4_GPIO_PZR0_P3                         *((volatile  uint8_t *)(0x42DEE00CUL))
#define bFM_GPIO_PZR0_P4                          *((volatile  uint8_t *)(0x42DEE010UL))
#define bFM4_GPIO_PZR0_P4                         *((volatile  uint8_t *)(0x42DEE010UL))

#define bFM_GPIO_PZR1_P0                          *((volatile  uint8_t *)(0x42DEE080UL))
#define bFM4_GPIO_PZR1_P0                         *((volatile  uint8_t *)(0x42DEE080UL))
#define bFM_GPIO_PZR1_P1                          *((volatile  uint8_t *)(0x42DEE084UL))
#define bFM4_GPIO_PZR1_P1                         *((volatile  uint8_t *)(0x42DEE084UL))
#define bFM_GPIO_PZR1_P2                          *((volatile  uint8_t *)(0x42DEE088UL))
#define bFM4_GPIO_PZR1_P2                         *((volatile  uint8_t *)(0x42DEE088UL))
#define bFM_GPIO_PZR1_P3                          *((volatile  uint8_t *)(0x42DEE08CUL))
#define bFM4_GPIO_PZR1_P3                         *((volatile  uint8_t *)(0x42DEE08CUL))

#define bFM_GPIO_PZR2_P0                          *((volatile  uint8_t *)(0x42DEE100UL))
#define bFM4_GPIO_PZR2_P0                         *((volatile  uint8_t *)(0x42DEE100UL))
#define bFM_GPIO_PZR2_P1                          *((volatile  uint8_t *)(0x42DEE104UL))
#define bFM4_GPIO_PZR2_P1                         *((volatile  uint8_t *)(0x42DEE104UL))
#define bFM_GPIO_PZR2_P2                          *((volatile  uint8_t *)(0x42DEE108UL))
#define bFM4_GPIO_PZR2_P2                         *((volatile  uint8_t *)(0x42DEE108UL))
#define bFM_GPIO_PZR2_P3                          *((volatile  uint8_t *)(0x42DEE10CUL))
#define bFM4_GPIO_PZR2_P3                         *((volatile  uint8_t *)(0x42DEE10CUL))

#define bFM_GPIO_PZR3_P0                          *((volatile  uint8_t *)(0x42DEE180UL))
#define bFM4_GPIO_PZR3_P0                         *((volatile  uint8_t *)(0x42DEE180UL))
#define bFM_GPIO_PZR3_P1                          *((volatile  uint8_t *)(0x42DEE184UL))
#define bFM4_GPIO_PZR3_P1                         *((volatile  uint8_t *)(0x42DEE184UL))
#define bFM_GPIO_PZR3_P2                          *((volatile  uint8_t *)(0x42DEE188UL))
#define bFM4_GPIO_PZR3_P2                         *((volatile  uint8_t *)(0x42DEE188UL))
#define bFM_GPIO_PZR3_P3                          *((volatile  uint8_t *)(0x42DEE18CUL))
#define bFM4_GPIO_PZR3_P3                         *((volatile  uint8_t *)(0x42DEE18CUL))
#define bFM_GPIO_PZR3_P4                          *((volatile  uint8_t *)(0x42DEE190UL))
#define bFM4_GPIO_PZR3_P4                         *((volatile  uint8_t *)(0x42DEE190UL))
#define bFM_GPIO_PZR3_P5                          *((volatile  uint8_t *)(0x42DEE194UL))
#define bFM4_GPIO_PZR3_P5                         *((volatile  uint8_t *)(0x42DEE194UL))

#define bFM_GPIO_PZR4_P6                          *((volatile  uint8_t *)(0x42DEE218UL))
#define bFM4_GPIO_PZR4_P6                         *((volatile  uint8_t *)(0x42DEE218UL))
#define bFM_GPIO_PZR4_P7                          *((volatile  uint8_t *)(0x42DEE21CUL))
#define bFM4_GPIO_PZR4_P7                         *((volatile  uint8_t *)(0x42DEE21CUL))

