mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xk/common/mb9bf56xk.h
#define bFM_MFT1_FRT_TCAL_STOP00                  *((volatile  uint32_t*)(0x42422C80UL))
#define bFM4_MFT1_FRT_TCAL_STOP00                 *((volatile  uint32_t*)(0x42422C80UL))
#define bFM_MFT1_FRT_TCAL_STOP01                  *((volatile  uint32_t*)(0x42422C84UL))
#define bFM4_MFT1_FRT_TCAL_STOP01                 *((volatile  uint32_t*)(0x42422C84UL))
#define bFM_MFT1_FRT_TCAL_STOP02                  *((volatile  uint32_t*)(0x42422C88UL))
#define bFM4_MFT1_FRT_TCAL_STOP02                 *((volatile  uint32_t*)(0x42422C88UL))
#define bFM_MFT1_FRT_TCAL_STOP10                  *((volatile  uint32_t*)(0x42422C8CUL))
#define bFM4_MFT1_FRT_TCAL_STOP10                 *((volatile  uint32_t*)(0x42422C8CUL))
#define bFM_MFT1_FRT_TCAL_STOP11                  *((volatile  uint32_t*)(0x42422C90UL))
#define bFM4_MFT1_FRT_TCAL_STOP11                 *((volatile  uint32_t*)(0x42422C90UL))
#define bFM_MFT1_FRT_TCAL_STOP12                  *((volatile  uint32_t*)(0x42422C94UL))
#define bFM4_MFT1_FRT_TCAL_STOP12                 *((volatile  uint32_t*)(0x42422C94UL))
#define bFM_MFT1_FRT_TCAL_STOP20                  *((volatile  uint32_t*)(0x42422C98UL))
#define bFM4_MFT1_FRT_TCAL_STOP20                 *((volatile  uint32_t*)(0x42422C98UL))
#define bFM_MFT1_FRT_TCAL_STOP21                  *((volatile  uint32_t*)(0x42422C9CUL))
#define bFM4_MFT1_FRT_TCAL_STOP21                 *((volatile  uint32_t*)(0x42422C9CUL))
#define bFM_MFT1_FRT_TCAL_STOP22                  *((volatile  uint32_t*)(0x42422CA0UL))
#define bFM4_MFT1_FRT_TCAL_STOP22                 *((volatile  uint32_t*)(0x42422CA0UL))
#define bFM_MFT1_FRT_TCAL_SCLR00                  *((volatile  uint32_t*)(0x42422CC0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR00                 *((volatile  uint32_t*)(0x42422CC0UL))
#define bFM_MFT1_FRT_TCAL_SCLR01                  *((volatile  uint32_t*)(0x42422CC4UL))
#define bFM4_MFT1_FRT_TCAL_SCLR01                 *((volatile  uint32_t*)(0x42422CC4UL))
#define bFM_MFT1_FRT_TCAL_SCLR02                  *((volatile  uint32_t*)(0x42422CC8UL))
#define bFM4_MFT1_FRT_TCAL_SCLR02                 *((volatile  uint32_t*)(0x42422CC8UL))
#define bFM_MFT1_FRT_TCAL_SCLR10                  *((volatile  uint32_t*)(0x42422CCCUL))
#define bFM4_MFT1_FRT_TCAL_SCLR10                 *((volatile  uint32_t*)(0x42422CCCUL))
#define bFM_MFT1_FRT_TCAL_SCLR11                  *((volatile  uint32_t*)(0x42422CD0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR11                 *((volatile  uint32_t*)(0x42422CD0UL))
#define bFM_MFT1_FRT_TCAL_SCLR12                  *((volatile  uint32_t*)(0x42422CD4UL))
#define bFM4_MFT1_FRT_TCAL_SCLR12                 *((volatile  uint32_t*)(0x42422CD4UL))
#define bFM_MFT1_FRT_TCAL_SCLR20                  *((volatile  uint32_t*)(0x42422CD8UL))
#define bFM4_MFT1_FRT_TCAL_SCLR20                 *((volatile  uint32_t*)(0x42422CD8UL))
#define bFM_MFT1_FRT_TCAL_SCLR21                  *((volatile  uint32_t*)(0x42422CDCUL))
#define bFM4_MFT1_FRT_TCAL_SCLR21                 *((volatile  uint32_t*)(0x42422CDCUL))
#define bFM_MFT1_FRT_TCAL_SCLR22                  *((volatile  uint32_t*)(0x42422CE0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR22                 *((volatile  uint32_t*)(0x42422CE0UL))

#define bFM_MFT1_FRT_TCSA0_SCLR                   *((volatile  uint8_t *)(0x42422910UL))
#define bFM4_MFT1_FRT_TCSA0_SCLR                  *((volatile  uint8_t *)(0x42422910UL))
#define bFM_MFT1_FRT_TCSA0_MODE                   *((volatile  uint8_t *)(0x42422914UL))
#define bFM4_MFT1_FRT_TCSA0_MODE                  *((volatile  uint8_t *)(0x42422914UL))
#define bFM_MFT1_FRT_TCSA0_STOP                   *((volatile  uint8_t *)(0x42422918UL))
#define bFM4_MFT1_FRT_TCSA0_STOP                  *((volatile  uint8_t *)(0x42422918UL))
#define bFM_MFT1_FRT_TCSA0_BFE                    *((volatile  uint8_t *)(0x4242291CUL))
#define bFM4_MFT1_FRT_TCSA0_BFE                   *((volatile  uint8_t *)(0x4242291CUL))
#define bFM_MFT1_FRT_TCSA0_ICRE                   *((volatile  uint8_t *)(0x42422920UL))
#define bFM4_MFT1_FRT_TCSA0_ICRE                  *((volatile  uint8_t *)(0x42422920UL))
#define bFM_MFT1_FRT_TCSA0_ICLR                   *((volatile  uint8_t *)(0x42422924UL))
#define bFM4_MFT1_FRT_TCSA0_ICLR                  *((volatile  uint8_t *)(0x42422924UL))
#define bFM_MFT1_FRT_TCSA0_IRQZE                  *((volatile  uint8_t *)(0x42422934UL))
#define bFM4_MFT1_FRT_TCSA0_IRQZE                 *((volatile  uint8_t *)(0x42422934UL))
#define bFM_MFT1_FRT_TCSA0_IRQZF                  *((volatile  uint8_t *)(0x42422938UL))
#define bFM4_MFT1_FRT_TCSA0_IRQZF                 *((volatile  uint8_t *)(0x42422938UL))
#define bFM_MFT1_FRT_TCSA0_ECKE                   *((volatile  uint8_t *)(0x4242293CUL))
#define bFM4_MFT1_FRT_TCSA0_ECKE                  *((volatile  uint8_t *)(0x4242293CUL))

#define bFM_MFT1_FRT_TCSA1_SCLR                   *((volatile  uint8_t *)(0x42422A90UL))
#define bFM4_MFT1_FRT_TCSA1_SCLR                  *((volatile  uint8_t *)(0x42422A90UL))
#define bFM_MFT1_FRT_TCSA1_MODE                   *((volatile  uint8_t *)(0x42422A94UL))
#define bFM4_MFT1_FRT_TCSA1_MODE                  *((volatile  uint8_t *)(0x42422A94UL))
#define bFM_MFT1_FRT_TCSA1_STOP                   *((volatile  uint8_t *)(0x42422A98UL))
#define bFM4_MFT1_FRT_TCSA1_STOP                  *((volatile  uint8_t *)(0x42422A98UL))
#define bFM_MFT1_FRT_TCSA1_BFE                    *((volatile  uint8_t *)(0x42422A9CUL))
#define bFM4_MFT1_FRT_TCSA1_BFE                   *((volatile  uint8_t *)(0x42422A9CUL))
#define bFM_MFT1_FRT_TCSA1_ICRE                   *((volatile  uint8_t *)(0x42422AA0UL))
#define bFM4_MFT1_FRT_TCSA1_ICRE                  *((volatile  uint8_t *)(0x42422AA0UL))
#define bFM_MFT1_FRT_TCSA1_ICLR                   *((volatile  uint8_t *)(0x42422AA4UL))
#define bFM4_MFT1_FRT_TCSA1_ICLR                  *((volatile  uint8_t *)(0x42422AA4UL))
#define bFM_MFT1_FRT_TCSA1_IRQZE                  *((volatile  uint8_t *)(0x42422AB4UL))
#define bFM4_MFT1_FRT_TCSA1_IRQZE                 *((volatile  uint8_t *)(0x42422AB4UL))
#define bFM_MFT1_FRT_TCSA1_IRQZF                  *((volatile  uint8_t *)(0x42422AB8UL))
#define bFM4_MFT1_FRT_TCSA1_IRQZF                 *((volatile  uint8_t *)(0x42422AB8UL))
#define bFM_MFT1_FRT_TCSA1_ECKE                   *((volatile  uint8_t *)(0x42422ABCUL))
#define bFM4_MFT1_FRT_TCSA1_ECKE                  *((volatile  uint8_t *)(0x42422ABCUL))

